[
  {
    "contract_id": "CybergyHoldingsInc_Affiliate_Agreement.pdf",
    "summary": "This Marketing Affiliate Agreement between Birch First Global Investments Inc. and Mount Knowledge Holdings Inc. aims to formalize their prior verbal understandings regarding marketing and support of certain technology. Birch grants Mount Knowledge the right to market and sell the technology to specific clients, with Mount Knowledge responsible for customer support. Mount Knowledge must comply with local laws, protect intellectual property rights, and meet sales quotas outlined in the agreement. Both parties are obligated to provide training and support as needed. Late payment may incur a penalty. The agreement is automatically renewed annually unless terminated."
  },
  {
    "contract_id": "Chase_Affiliate_Agreement.pdf",
    "summary": "This agreement outlines the terms between Chase Bank USA and affiliates in the Chase Affiliate Program. Affiliates can earn fees for approved credit card accounts originating from their website. Affiliates must comply with content restrictions and not engage in prohibited activities. Chase reserves the right to terminate the agreement if violations occur. Affiliates are responsible for using approved creatives, obtaining consent for data collection, and adhering to referral fee guidelines. The agreement can be terminated by either party at any time, and Chase manages order processing and sales tracking."
  },
  {
    "contract_id": "DigitalCinemaDestinationsCorp_Affiliate_Agreement.pdf",
    "summary": "This agreement between National CineMedia, LLC (NCM) and Digital Cinema Destinations Corp. aims to expand NCM's advertising presence by providing digital content services to Network Affiliate's theaters. NCM will offer Advertising Services and the Video Display Program to Network Affiliate, who will display them in their theaters. Key obligations include NCM providing the services and Network Affiliate accepting and displaying them. Notable risks include breaches of confidentiality, change of control implications, and equipment purchase requirements for digitizing theaters."
  }
]