[
  {
    "contract_id": "CybergyHoldingsInc_Affiliate_Agreement.pdf",
    "summary": "This Marketing Affiliate Agreement between Birch First Global Investments Inc. and Mount Knowledge Holdings Inc. aims to formalize their prior verbal understandings regarding the marketing and support of certain technology. Birch grants Mount Knowledge the right to market and sell the technology to specific clients, while Mount Knowledge agrees to use its best efforts to do so. Mount Knowledge must protect copyrights and trademarks, comply with laws, keep accurate sales records, and submit annual marketing plans. Both parties must provide support and services as outlined. Payment terms, currency, and required documents for transactions are specified. Failure to comply may result in penalties."
  },
  {
    "contract_id": "ChaseAffiliateAgreement.pdf",
    "summary": "This agreement outlines the terms between Chase Bank USA and affiliates in the Chase Affiliate Program. Affiliates can earn fees for approved credit card accounts originating from their website. Affiliates must adhere to strict content guidelines and not engage in prohibited activities. Chase reserves the right to terminate the agreement if the affiliate violates the terms. The agreement covers enrollment, affiliate responsibilities, referral fees, approved accounts, termination conditions, links, order processing, tracking of sales, credit card terms, customer relations, product descriptions, copyrighted material, commercial use, and trademarks."
  },
  {
    "contract_id": "DigitalCinemaDestinationsCorp_NetworkAffiliate_Agreement.pdf",
    "summary": "This agreement between National CineMedia, LLC (NCM) and Digital Cinema Destinations Corp. aims to expand NCM's advertising presence in Network Affiliate's theatres. NCM will provide Advertising Services to Network Affiliate, who will display them in their theatres. Key obligations include NCM providing the Service and Network Affiliate accepting and displaying it. Notable risks include breaches of confidentiality regarding technical and non-technical information, as well as obligations related to equipment installation and costs."
  }
]