[
  {
    "contract_id": "CybergyHoldingsInc_Affiliate_Agreement.pdf",
    "summary": "This Marketing Affiliate Agreement between Birch First Global Investments Inc. and Mount Knowledge Holdings Inc. aims to formalize their prior verbal understandings regarding the marketing and support of certain technology. Birch grants Mount Knowledge the right to market and sell the technology to specific clients, while Mount Knowledge agrees to use best efforts in marketing, licensing, and providing support. Mount Knowledge must comply with local laws, protect intellectual property rights, and maintain accurate sales records. The agreement also outlines payment terms, training requirements, and annual sales quotas. Failure to comply with the agreement may result in penalties such as late payment charges."
  },
  {
    "contract_id": "ChaseAffiliateAgreement.pdf",
    "summary": "This agreement outlines the terms between Chase Bank USA and affiliates in the Chase Affiliate Program. Affiliates can earn fees for approved credit card accounts originating from their website. Affiliates must adhere to strict content guidelines to avoid termination. Responsibilities include using approved creatives, not collecting personal information without consent, and complying with Chase's rules. Referral fees are based on approved accounts, and the agreement can be terminated by either party. Chase handles order processing, tracking sales, and determines credit card terms. Affiliates must follow trademark guidelines and use the program for commercial purposes only."
  },
  {
    "contract_id": "DigitalCinemaDestinationsCorp_Affiliate_Agreement.pdf",
    "summary": "This agreement between National CineMedia, LLC (NCM) and Digital Cinema Destinations Corp. aims to expand NCM's advertising presence in Network Affiliate's theatre circuit. NCM will provide Advertising Services to Network Affiliate for display in its theatres. Network Affiliate must accept and display the Service as per the terms. Key obligations include NCM providing the Service and Network Affiliate displaying it. Risks include breach of confidentiality regarding proprietary information and failure to meet quality standards."
  }
]