[
  {
    "contract_id": "CybergyHoldingsInc_Affiliate_Agreement.pdf",
    "termination_clause": "This agreement shall begin upon the date of its execution by MA and acceptance in writing by Company and shall remain in effect until the end of the current calendar year and shall be automatically renewed for successive one (1) year periods unless otherwise terminated according to the cancellation or termination provisions contained in paragraph 18 of this Agreement.",
    "confidentiality_clause": "Copyrights and Trademarks. MA shall protect copyrights, tradenames, trademarks, service marks, trade secrets and other confidential proprietary rights and information of Company and its affiliates and report promptly any infringements or suspected infringements of which MA becomes aware and to cooperate fully with Company in its efforts to protect its copyrights, tradenames, trademarks, service marks, trade secrets and other confidential proprietary rights and information.",
    "liability_clause": "Permits, Licenses and Compliance with Laws. MA shall be responsible and shall bear all costs for complying with local, state, provincial, federal, national, and international statutes, rules, regulations and ordinances of any kind which related to or affect MA’s duties under this Agreement."
  },
  {
    "contract_id": "CreditcardscomInc_Affiliate_Agreement.pdf",
    "termination_clause": "Either Affiliate or Chase may terminate this Agreement at any time, with or without cause, by giving the other party written or e-mail notice of termination. At the time of termination, any links to Chase’s Website must be removed immediately. Affiliate will continue to receive Commission payments for all Approved Accounts placed during the term of this Agreement. Notwithstanding the foregoing, Chase may terminate this Agreement if Affiliate does not comply with the terms and conditions herein.",
    "confidentiality_clause": "Affiliate cannot use or implement creative that is not available through the LinkShare affiliate interface. Affiliates may not harvest or collect personal information, or email addresses using the Chase brand without the written consent of Chase. If Affiliate manages a sub-affiliate network, upon Chase’s request, Affiliate shall promptly provide Chase with a current, written list identifying the sub-affiliates or other third parties associated. Chase reserves the right to review and approve all sub-affiliate partners.",
    "liability_clause": "Chase will be solely responsible for processing each order placed by a customer from Affiliate’s Links. Customers may only use the Chase on-line application process to apply for a Chase credit card. “Customers” are defined herein as individuals who apply for Chase credit cards through a link in Affiliate’s Web site. Chase shall be responsible for administering application forms and related customer service. All of the rules, operating procedures and policies of Chase regarding customer orders and accounts will apply to orders received through the Links. Chase reserves the right to reject any credit card application in its sole discretion."
  },
  {
    "contract_id": "DigitalCinemaDestinationsCorp_Affiliate_Agreement.pdf",
    "termination_clause": "Section 8.1. Term. This Agreement shall commence on the Effective Date and shall continue in full force and effect for a period of five (5) years from the Effective Date (the “Initial Term”). Thereafter, this Agreement shall automatically renew for successive one (1) year periods (each, a “Renewal Term”) unless either Party gives written notice of its intent not to renew this Agreement at least one hundred eighty (180) days prior to the expiration of the then-current term.",
    "confidentiality_clause": "“Confidential Information” means any and all technical and non-technical information of or related to either Party, including, without limitation, proprietary information, know-how, the NCM Property and Derived Works, and information related to or regarding either Party’s research and development, finances, suppliers, customers, business forecasts, and marketing plans, in whatever form disclosed or made available. Confidential Information does not include information which: (i) the recipient can demonstrate was already known to it at the time of its receipt hereunder; (ii) is or becomes generally available to the public other than by means of the recipient's breach of its obligations under this Agreement; (iii) is independently obtained from a third party whose disclosure violates no duty of confidentiality; or (iv) is independently developed by or on behalf of the recipient without use of or reliance on any Confidential Information furnished to it under this Agreement.",
    "liability_clause": "Section 11.2. Infringement. NCM shall indemnify, defend and hold harmless Network Affiliate, its affiliates, and their respective officers, directors, employees and agents from and against any and all claims, demands, actions, suits, losses, costs, charges, expenses, damages and liabilities, including reasonable attorneys’ fees and costs, arising out of or in connection with any claim that the Service or the use thereof infringes any patent, copyright, trademark, trade secret or other intellectual property right of any third party."
  }
]